/* 
	1. Створіть Javascript файл, який потрібно буде підключити в index.html. 
	   В Javascript додайте повідомлення на екран, яке буде вітати користувача.
*/

alert('Hello');
document.write('Hello');

/* 2. Робота зі змінними */

var firstName;
var lastName;

firstName = 'Alex';
lastName = firstName;

/* 3. Імена змінних. Придумайте правильні, хороші імена для таких даних.  */
var firstName;
var lastName;
var levelEducation;
var outsideInterest;

/* 4. Інкремент / Декремент. Без запуску коду, дайте відповідь який
	  результат буде виведений на екран.
*/
var a = 1, b = 1, c, d;

//c = ++x; alert(c); //undefined x не определенна 
d = b++; alert(d); // 1 постфиксная форма сначала вернет значение, а потом увеличит на 1
c = (2 + ++a); alert(c); // 4 префиксная форма сначала увеличит на 1 и вернет полученное значение
d = (2 + b++); alert(d); // 4 это постфиксная форма, но в строке 32 уже увеличено до 2. 

/* 5. Взаємодія з користувачем. Виведіть на екран суму двох чисел. Для цього вам потрібно буде
	  використовувати два рази prompt, щоб зберегти два числа в змінні і один раз alert, який
	  виведе результат складання.
*/

var firstNumber =  prompt('Введите первое число');
var secondNumber =  prompt('Введите первое число');
var result = +firstNumber + (+secondNumber);
alert (result);


